<?php
/**
 * Author: Vitalii Sydorenko <vetal.sydo@gmail.com>
 * Date: 3/17/2016
 */
?>
<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Encapsulation</title>
</head>
<body>
<h1>Encapsulation</h1>
<p><strong>Инкапсуляция</strong> - сокрытие реализации за ясным интерфейсом. Примером явяеться PDO, где мы
    используем единый интерфейс для доступа к нескольким базам данным.</p>
<p><strong>Инкапсуляция</strong> - это механизм позволяющий нам обеспечить соглассованость и целосность данных
    какого-нибудь обьъекла либо класса и защитить их от некоретного использования и от повреждения, с общем от
    приведения в какое-нибудь некорректное состояние. Для этого мы предоставляем какой-нибудь контракт(договоренность)
    либо интерфейс.</p>
</body>
</html>
