<?php
/**
 * Author: Vitalii Sydorenko <vetal.sydo@gmail.com>
 */
?>
<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title></title>
</head>
<body>
<h1><a href="../">SOLID</a></h1>
<h2>Single responsibility principle - Принцип единственной обязанности</h2>
<p>Любой объект должен иметь лишь одну обязанность и эта обязанность должна быть полностью реализована в классе
    объекта. Из этого следует что у нас может быть лишь одна причина что бы вносить изменения в класс обьекта.</p>

<p>Пример нарушения принципа - в 1 классе у нас содержаться методы для работы с сохоенения продукта в БД и логирования -
    2 обязанности в 1 классе</p>
</body>
</html>
