<?php
/**
 * Author: Vitalii Sydorenko <vetal.sydo@gmail.com>
 */
?>
<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Dependency inversion principle - Принцип инверсии зависимостей</title>
</head>
<body>
<h1><a href="../">SOLID</a></h1>
<h2>Dependency inversion principle - Принцип инверсии зависимостей</h2>
<p>Зависимости должны строиться относительно абстракций а не деталей.</p>

<p>Классическая формулировка: Зависимости внутри системы строяться на основе абстракций. Модули верхних уровней не
    должны зависить от моделей нижних уровней. Оба типа модулей должны зависить от абстрпакций. Абстракции не должны
    зависить от деталей. Детали должны зависить от абстракций.</p>

<p>Пример с ранговым мущиной, и методом есть (зависимость от жены)</p>
</body>
</html>
